#4. Составьте программу определения идеального веса человека, если он
#считается по формуле: идеальный вес (кг)= рост (см) – 100.
sm = float(input('Введите свой рост '))
ideal = sm - 100
print('Ваш идеальный вес = ',ideal)
input("\n\nНажмите Enter чтобы выйти")

