#9. Составьте программу, которая вычисляет площадь равностороннего треугольника
h = float(input('Введите длину высоты равностороннего треугольника '))
a = float(input('Введите длину стороны равностороннего треугольника '))
s = 0.5*a*h
print('Площадь треугольника =',s)
input("\n\nНажмите Enter чтобы выйти")

